In [2]:
print("Hello World!")

Hello World!

<p style="color:pink; font-weight:bold; font-style:italic; font-size:30px">üçìArithmetic and Variables</p>

<img src="images\01.jpg" alt="My Image" width="400" height="300">

In [3]:
print(((1 + 3) * (9 - 2) / 2) ** 2)

196.0

In [16]:
# Variables

name = "AmirReza"
age = 15
tel = 9194324531
print(name)
print(name + ' Mashayekhi' )
print(f"Name:{name} Age:{age}")
print("Name:",name, "Age:",age)

AmirReza
AmirReza Mashayekhi
Name:AmirReza Age:15
Name: AmirReza Age: 15

In [17]:
num_years = 4
days_per_year = 365 
hours_per_day = 24
mins_per_hour = 60
secs_per_min = 60

total_secs = secs_per_min * mins_per_hour * hours_per_day * days_per_year * num_years
print(total_secs)

126144000

In [18]:
# Update to include leap years
days_per_year = 365.25

# Calculate number of seconds in four years
total_secs = secs_per_min * mins_per_hour * hours_per_day * days_per_year * num_years
print(total_secs)

126230400.0

In [21]:
# NameError
print(hours_per_day)

24

In [29]:
# Load the data from the titanic competition
import pandas as pd
titanic_data = pd.read_csv("datasets/titanic/train.csv")

# Show the first five rows of the data
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [30]:
# Number of total passengers
total = len(titanic_data)
print(total)

# Number of passengers who survived
survived = (titanic_data.Survived == 1).sum()
print(survived)

# Number of passengers under 18
minors = (titanic_data.Age < 18).sum()
print(minors)

891
342
113

In [31]:
# TODO: Fill in the value of the survived_fraction variable
survived_fraction = survived/total

# Print the value of the variable
print(survived_fraction)

# TODO: Fill in the value of the minors_fraction variable
minors_fraction = minors/total 

# Print the value of the variable
print(minors_fraction)

0.3838383838383838
0.12682379349046016

<p style="color:pink; font-weight:bold; font-style:italic; font-size:30px">üçìFunction</p>